{
	"shell": {
		"required_xor": {
			"inline": {
				"type": "array of strings",
				"description": "This is an array of commands to execute. The commands are concatenated by newlines and turned into a single file, so they are all executed within the same context. This allows you to change directories in one command and use something in the directory in the next and so on. Inline scripts are the easiest way to pull of simple tasks within the machine."
        	},
			"script": {
    			"type": "string",
        		"description": "The path to a script to upload and execute in the machine. This path can be absolute or relative. If it is relative, it is relative to the working directory when Packer is executed."
			},
			"scripts": {
				"type": "array of strings",
	            "description": "An array of scripts to execute. The scripts will be uploaded and executed in the order specified. Each script is executed in isolation, so state such as variables from one script won't carry on to the next."
			}
    	},
    	"optional": {
    	    "environment_vars": {
    	    	"type": "array of strings",
				"description": "An array of key/value pairs to inject prior to the execute_command. The format should be key=value. Packer injects some environmental variables by default into the environment, as well, which are covered in the section below."
			},
            "execute_command": {
				"type": "string",
				"description": "The command to use to execute the script. By default this is chmod +x {{ .Path }}; {{ .Vars }} {{ .Path }}. The value of this is treated as configuration template. There are two available variables: Path, which is the path to the script to run, and Vars, which is the list of environment_vars, if configured."
			},
        	"inline_shebang": {
				"type": "string",
				"description": "The 'shebang' value to use when running commands specified by inline. By default, this is /bin/sh. If you're not using inline, then this configuration has no effect."
			},
        	"remote_path": {
				"type": "string",
				"description": "The path where the script will be uploaded to in the machine. This defaults to \"/tmp/script.sh\". This value must be a writable location and any parent directories must already exist."
			},
			"start_retry_timeout": {
				"type": "string",
				"description": "The amount of time to attempt to start the remote process. By default this is \"5m\" or 5 minutes. This setting exists in order to deal with times when SSH may restart, such as a system reboot. Set this to a higher value if reboots take a longer amount of time."
			}
		}
	}
}
